# 03 Import libraries

In [3]:
import pandas as pd
import numpy as np
import os

# 03 Import dataframe

In [6]:
path = r'C:\Users\shaiv\Downloads\Instacart Basket Analysis'
path

'C:\\Users\\shaiv\\Downloads\\Instacart Basket Analysis'

In [8]:
df = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'))

# 04 Wrangling the data

In [11]:
# Printing rows
df.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [13]:
# check the shape
df.shape

(206209, 10)

In [15]:
# Renaming columns

df = df.rename(columns={
    'Surnam': 'Last Name',
    'STATE': 'State',
    'date_joined': 'Date Joined',
    'n_dependants': 'Number of dependents',
    'fam_status': 'Family Status',
    'income': 'Income'})

In [17]:
df.describe()

             user_id            Age  Number of dependents         Income
count  206209.000000  206209.000000         206209.000000  206209.000000
mean   103105.000000      49.501646              1.499823   94632.852548
std     59527.555167      18.480962              1.118433   42473.786988
min         1.000000      18.000000              0.000000   25903.000000
25%     51553.000000      33.000000              0.000000   59874.000000
50%    103105.000000      49.000000              1.000000   93547.000000
75%    154657.000000      66.000000              3.000000  124244.000000
max    206209.000000      81.000000              3.000000  593901.000000

In [19]:
df.head()

,user_id,First Name,Last Name,Gender,State,Age,Date Joined,Number of dependents,Family Status,Income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

##### The name of columns has changed and looks organised. We are not dropping any columns because the all columns provide useful information. Looking at the data statistics there are no descripencies in the data.

# 05 Complete the fundamental data quality and consistency checks

In [23]:
# Check data type
df.dtypes

user_id                  int64
First Name              object
Last Name               object
Gender                  object
State                   object
Age                      int64
Date Joined             object
Number of dependents     int64
Family Status           object
Income                   int64
dtype: object

In [25]:
# Checking mixed data type in each column
for col in df.columns.tolist():
    weird = (df[[col]].map(type) != df[[col]].iloc[0].apply(type)).any(axis = 1)
    if len(df[weird]) > 0:
        print (col)

First Name

In [26]:
# Changing the First Name data type to string
df['First Name'] = df['First Name'].astype('str')

In [27]:
# Check data type
df.dtypes

user_id                  int64
First Name              object
Last Name               object
Gender                  object
State                   object
Age                      int64
Date Joined             object
Number of dependents     int64
Family Status           object
Income                   int64
dtype: object

In [31]:
# Check for missing data
df.isnull().sum()

user_id                 0
First Name              0
Last Name               0
Gender                  0
State                   0
Age                     0
Date Joined             0
Number of dependents    0
Family Status           0
Income                  0
dtype: int64

In [33]:
# Check for duplicates
df_dups = df[df.duplicated()]

In [35]:
df_dups

Empty DataFrame
Columns: [user_id, First Name, Last Name, Gender, State, Age, Date Joined, Number of dependents, Family Status, Income]
Index: []

##### We have changed the data type for 'First name' column to string. There are no missing values or duplicate values

# 06 Combing the data

In [39]:
# Importing instacart data
ords_prods = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'ords_prods_new_variables.pkl'))

In [40]:
# Check the shape of Instacart data
ords_prods.shape

(32404859, 23)

In [41]:
# Check the shape of customer data
df.shape

(206209, 10)

In [42]:
# Print ords_prods columns
ords_prods.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,first_order,product_id,add_to_cart_order,reordered,...,prices,prices_range_loc,busiest_days,busiest_period_of_day,max_order,loyalty_flag,average_spend,spender_flag,customer_frequency,frequency_flag
0,2539329,1,1,2,8,NaN,True,196,1,0,...,9.0,Mid-range product,Regularly busy,Average orders,10,New customer,6.367797,Low_spender,20.5,Non-frequent customer
1,2539329,1,1,2,8,NaN,True,14084,2,0,...,12.5,Mid-range product,Regularly busy,Average orders,10,New customer,6.367797,Low_spender,20.5,Non-frequent customer
2,2539329,1,1,2,8,NaN,True,12427,3,0,...,4.4,Low-range product,Regularly busy,Average orders,10,New customer,6.367797,Low_spender,20.5,Non-frequent customer
3,2539329,1,1,2,8,NaN,True,26088,4,0,...,4.7,Low-range product,Regularly busy,Average orders,10,New customer,6.367797,Low_spender,20.5,Non-frequent customer
4,2539329,1,1,2,8,NaN,True,26405,5,0,...,1.0,Low-range product,Regularly busy,Average orders,10,New customer,6.367797,Low_spender,20.5,Non-frequent customer

##### Looking at the both the data we can say that User ID column is common in both the data

In [44]:
ords_prods.dtypes

order_id                    int64
user_id                     int64
order_number                int64
orders_day_of_week          int64
order_hour_of_day           int64
days_since_prior_order    float64
first_order                  bool
product_id                  int64
add_to_cart_order           int64
reordered                   int64
product_name               object
aisle_id                    int64
department_id               int64
prices                    float64
prices_range_loc           object
busiest_days               object
busiest_period_of_day      object
max_order                   int64
loyalty_flag               object
average_spend             float64
spender_flag               object
customer_frequency        float64
frequency_flag             object
dtype: object

In [45]:
# Merging the data
ords_prods_custs = pd.merge(ords_prods, df, on = 'user_id', how = 'inner')

In [46]:
ords_prods_custs.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,first_order,product_id,add_to_cart_order,reordered,...,frequency_flag,First Name,Last Name,Gender,State,Age,Date Joined,Number of dependents,Family Status,Income
0,2539329,1,1,2,8,NaN,True,196,1,0,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
1,2539329,1,1,2,8,NaN,True,14084,2,0,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
2,2539329,1,1,2,8,NaN,True,12427,3,0,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
3,2539329,1,1,2,8,NaN,True,26088,4,0,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
4,2539329,1,1,2,8,NaN,True,26405,5,0,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423

In [47]:
# Check the shape of merged data
ords_prods_custs.shape

(32404859, 32)

##### The number of rows before and after merge are same, so no rows are missing.

# 08 Exporting data

In [51]:
ords_prods_custs.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'ords_prods_custs_merge.pkl'))